CF/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АналитикаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АналитикаХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CF/InformationRegisters/СоответствиеНоменклатурыЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатурыЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьАлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусУказанияСерий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Справка2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/AccumulationRegisters/ТоварыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОрганизаций</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОрганизацияОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыПлатежныхАгентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CF/Enums/ТипыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТорговыйЗал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкладскоеПомещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Enums/СтатусыОбработкиТТНВходящейЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыОбработкиТТНВходящейЕГАИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятИзЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПодтвержденияКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПодтвержденияПереданВУТМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПодтвержденияОбрабатываетсяЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПодтвержденияОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОтказаКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОтказаПереданВУТМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОтказаОбрабатываетсяЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОтказаОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктРасхожденийКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктРасхожденийПереданВУТМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктРасхожденийОбрабатываетсяЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктРасхожденийОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвержденСРасхождениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтмененПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияПереданВУТМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияОбрабатываетсяЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПереданВЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПринятОтказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПринятоПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПринятАктРасхождений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПереданоПодтверждениеАктаРасхождений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПереданОтказОтАктаРасхождений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОбрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуАктаОтказаКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуАктаОтказаПереданВУТМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуАктаОтказаОбрабатываетсяЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуАктаОтказаОшибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Enums/СтатусыПриказовНаПроведениеИнвентаризацийТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыПриказовНаПроведениеИнвентаризацийТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Documents/ПриказНаПроведениеИнвентаризацииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПриказНаПроведениеИнвентаризацииТоваров</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаОтбораТоваровИнвентаризации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаОтбораТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПриказовНаПроведениеИнвентаризацийТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CF/Catalogs/Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Склады</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСклада</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/CommonModules/КорректировкаОстатковЕГАИСПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает таблицу учетных остатков алкогольной продукции.
//
// Параметры:
//  ДатаОстатков - Дата - дата получения остатков,
//  Организация - ОпределяемыйТип.ОрганизацияКонтрагентЕГАИС - ссылка на собственную организацию,
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - торговый объект для получения остатков,
//  КорректироватьОстаткиНемаркируемойПродукции - Булево - признак корректировки остатков немаркируемой продукции.
//
// Возвращаемое значение:
//   ТаблицаЗначений - учетные остатки. Колонки таблицы:
//    * Номенклатура - ОпределяемыйТип.Номенклатура
//    * Характеристика - ОпределяемыйТип.ХарактеристикаНоменклатуры
//    * ПродаетсяВРозлив - Булево
//    * ОбъемДАЛ - Число
//    * ТипПродукции - ПеречислениеСсылка.ТипыПродукцииЕГАИС
//    * ОстатокСкладБазЕд - Число - остаток в базовых единицах измерения (для оптового склада)
//    * ОстатокТорговыйЗалБазЕд - Число - остаток в базовых единицах измерения (для розничного магазина)
//    * ОстатокСклад - Число - остаток в штуках для фасованной и в ДАЛах для нефасованной продукциии (для оптового склада)
//    * ОстатокТорговыйЗал - Число - остаток в штуках для фасованной и в ДАЛах для нефасованной продукциии (для розничного магазина)
//
Функция УчетныеОстатки(ДатаОстатков, Организация, ТорговыйОбъект, КорректироватьОстаткиНемаркируемойПродукции) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Магазин"     , ТорговыйОбъект);
	Запрос.УстановитьПараметр("Организация" , Организация);
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	Запрос.УстановитьПараметр("КорректироватьОстаткиНемаркируемойПродукции", КорректироватьОстаткиНемаркируемойПродукции);
	
	Если Справочники.Организации.КоличествоОрганизаций() > 1 Тогда
		Запрос.Текст = ТекстЗапросаТоварыОрганизаций(ТорговыйОбъект);
	Иначе
		Запрос.Текст = ТекстЗапросаТоварыНаСкладах(ТорговыйОбъект);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Заполняет в табличной части коэффициент пересчета в декалитры для базовой единицы измерения номенклатуры.
//
// Параметры:
//  ТабличнаяЧасть - ТабличнаяЧасть - табличная часть, в которой нужно обновить коэффициент.
//
Процедура ЗаполнитьКоэффициентПересчетаВДАЛ(ТабличнаяЧасть) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТабличнаяЧасть", ТабличнаяЧасть);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТабличнаяЧасть.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ТабличнаяЧасть.ОбъемДАЛ КАК КоэффициентПересчета,
	|	ТабличнаяЧасть.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ИсходнаяТаблица
	|ИЗ
	|	&ТабличнаяЧасть КАК ТабличнаяЧасть
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсходнаяТаблица.Номенклатура,
	|	ИсходнаяТаблица.Номенклатура.ОбъемДАЛ КАК КоэффициентПересчета,
	|	ИсходнаяТаблица.НомерСтроки
	|ИЗ
	|	ИсходнаяТаблица КАК ИсходнаяТаблица
	|ГДЕ
	|	ИсходнаяТаблица.Номенклатура.ОбъемДАЛ <> ИсходнаяТаблица.КоэффициентПересчета";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТабличнаяЧасть[Выборка.НомерСтроки - 1].ОбъемДАЛ = Выборка.КоэффициентПересчета;
	КонецЦикла;
	
КонецПроцедуры

// В процедуре необходимо определить значения переменных ЭтоСклад и ЭтоТорговыйЗал в зависимости от типа торгового объекта.
//
// Параметры:
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - ссылка на собственный торговый объект,
//  ЭтоСклад - Булево - признак того, что торговый объект является складским помещением. Выходной параметр,
//  ЭтоТорговыйЗал - Булево - признак того, что торговый объект является торговым залом. Выходной параметр.
//
Процедура ПриОпределенииТипаТорговогоОбъекта(ТорговыйОбъект, ЭтоСклад, ЭтоТорговыйЗал) Экспорт
	
	ЭтоСклад = Ложь;
	ЭтоТорговыйЗал = Истина;
	
КонецПроцедуры

// Проверяет наличие документа инвентаризации по складу.
//
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияКонтрагентЕГАИС - ссылка на собственную организацию,
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - ссылка на собственный торговый объект,
//  ТекстОшибкиСклад - Строка, ФорматированнаяСтрока - текст ошибки проверки инвентаризации на складе. Выходной параметр,
//  ТекстОшибкиТорговыйЗал - Строка, ФорматированнаяСтрока - текст ошибки проверки инвентаризации в торговом зале. Выходной параметр,
//  ОтчетПоРасхождениямСклад - Булево - если Истина, будет доступна ссылка на формирование отчета по излишкам/недостачам. Выходной параметр,
//  ОтчетПоРасхождениямТорговыйЗал - Булево - если Истина, будет доступна ссылка на формирование отчета по излишкам/недостачам. Выходной параметр.
//
Процедура ПроверитьНаличиеИнвентаризации(Организация, ТорговыйОбъект, ТекстОшибкиСклад, ТекстОшибкиТорговыйЗал, ОтчетПоРасхождениямСклад, ОтчетПоРасхождениямТорговыйЗал) Экспорт
	
	ТекстОшибкиСклад = "";
	ТекстОшибкиТорговыйЗал = "";
	
	Если ИспользуетсяНесколькоСкладов(ТорговыйОбъект) Тогда
		
		ТекстОшибкиСклад = ПроверитьНаличиеИнвентаризацииПоСкладу(Организация, ТорговыйОбъект, Перечисления.ТипыСкладов.СкладскоеПомещение);
		
		ТекстОшибкиТорговыйЗал = ПроверитьНаличиеИнвентаризацииПоСкладу(Организация, ТорговыйОбъект, Перечисления.ТипыСкладов.ТорговыйЗал);
		
	Иначе
		
		ТекстОшибкиТорговыйЗал = ПроверитьНаличиеИнвентаризацииПоСкладу(Организация, ТорговыйОбъект);
		
	КонецЕсли;
	
	ОтчетПоРасхождениямСклад = НЕ ПустаяСтрока(ТекстОшибкиСклад);
	ОтчетПоРасхождениямТорговыйЗал = НЕ ПустаяСтрока(ТекстОшибкиТорговыйЗал);
	
КонецПроцедуры

// Вызывается после заполнения таблицы значений неподтвержденными документами.
//
// Параметры:
//  НеподтвержденныеДокументы - ТаблицаЗначений - таблица с найденными неподтвержденными документами,
//  ОрганизацияЕГАИС - СправочникСсылка.КлассификаторОрганизацийЕГАИС - собственная организация по классификатору.
//
Процедура ПриПроверкеНеподтвержденныхДокументов(НеподтвержденныеДокументы, ОрганизацияЕГАИС) Экспорт
	
	СписокСтатусов = Новый Массив;
	СписокСтатусов.Добавить(Перечисления.СтатусыОбработкиТТНВходящейЕГАИС.Подтвержден);
	СписокСтатусов.Добавить(Перечисления.СтатусыОбработкиТТНВходящейЕГАИС.ПодтвержденСРасхождениями);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	Запрос.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТТНВходящая.Ссылка КАК ДокументСсылка
	|ИЗ
	|	Документ.ТТНВходящаяЕГАИС КАК ТТНВходящая
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|		ПО ТТНВходящая.Ссылка = ПоступлениеТоваров.ТТНВходящаяЕГАИС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|		ПО ТТНВходящая.Ссылка = СтатусыДокументовЕГАИС.Документ
	|ГДЕ
	|	ТТНВходящая.Проведен
	|	И ТТНВходящая.Грузополучатель = &ОрганизацияЕГАИС
	|	И НЕ СтатусыДокументовЕГАИС.Статус В (&СписокСтатусов)
	|	И ПоступлениеТоваров.Проведен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = НеподтвержденныеДокументы.Найти(Выборка.ДокументСсылка, "ДокументСсылка");
		Если СтрокаТаблицы = Неопределено Тогда
			СтрокаТаблицы = НеподтвержденныеДокументы.Добавить();
			СтрокаТаблицы.ДокументСсылка = Выборка.ДокументСсылка;
			СтрокаТаблицы.ТипЗначения = Документы.ТТНВходящаяЕГАИС.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Вызывается после заполнения таблицы значений документами, требующих оформления.
//
// Параметры:
//  НеоформленныеДокументы - ТаблицаЗначений - таблица с найденными документами,
//  ОрганизацияЕГАИС - СправочникСсылка.КлассификаторОрганизацийЕГАИС - собственная организация по классификатору.
//
Процедура ПриПроверкеНеоформленныхДокументов(НеоформленныеДокументы, ОрганизацияЕГАИС) Экспорт
	
	СписокСтатусов = Новый Массив;
	СписокСтатусов.Добавить(Перечисления.СтатусыОбработкиТТНВходящейЕГАИС.Подтвержден);
	СписокСтатусов.Добавить(Перечисления.СтатусыОбработкиТТНВходящейЕГАИС.ПодтвержденСРасхождениями);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	Запрос.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТТНВходящая.Ссылка КАК ДокументСсылка
	|ИЗ
	|	Документ.ТТНВходящаяЕГАИС КАК ТТНВходящая
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|		ПО ТТНВходящая.Ссылка = ПоступлениеТоваров.ТТНВходящаяЕГАИС
	|			И (ПоступлениеТоваров.Проведен)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|		ПО ТТНВходящая.Ссылка = СтатусыДокументовЕГАИС.Документ
	|ГДЕ
	|	ТТНВходящая.Проведен
	|	И ТТНВходящая.Грузополучатель = &ОрганизацияЕГАИС
	|	И СтатусыДокументовЕГАИС.Статус В(&СписокСтатусов)
	|	И ПоступлениеТоваров.Ссылка ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = НеоформленныеДокументы.Найти(Выборка.ДокументСсылка, "ДокументСсылка");
		Если СтрокаТаблицы = Неопределено Тогда
			СтрокаТаблицы = НеоформленныеДокументы.Добавить();
			СтрокаТаблицы.ДокументСсылка = Выборка.ДокументСсылка;
			СтрокаТаблицы.ТипЗначения = Документы.ТТНВходящаяЕГАИС.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииРТ

// Возвращает Истина, если у магазина есть склады с разным типом.
//
Функция ИспользуетсяНесколькоСкладов(Магазин)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Магазин", Магазин);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Склады.ТипСклада КАК ТипСклада
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Магазин = &Магазин
	|	И НЕ Склады.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Количество() > 1;
	
КонецФункции

// Проверяет наличие проведенного приказа на инвентаризацию по магазину.
//
Функция ПроверитьНаличиеИнвентаризацииПоСкладу(Организация, ТорговыйОбъект, ТипСклада = Неопределено)
	
	МестоПроведения = ?(ТипСклада = Перечисления.ТипыСкладов.ТорговыйЗал, "ВТорговомЗале", "НаСкладе");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Магазин"    , ТорговыйОбъект);
	Запрос.УстановитьПараметр("ТипСклада"  , ТипСклада);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Склад,
	|	ЕСТЬNULL(ПриказНаПроведениеИнвентаризацииТоваров.Ссылка, ЗНАЧЕНИЕ(Документ.ПриказНаПроведениеИнвентаризацииТоваров.ПустаяСсылка)) КАК ДокументСсылка,
	|	ЕСТЬNULL(ПриказНаПроведениеИнвентаризацииТоваров.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончания,
	|	ЕСТЬNULL(ПриказНаПроведениеИнвентаризацииТоваров.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыПриказовНаПроведениеИнвентаризацийТоваров.ПустаяСсылка)) КАК Статус
	|ИЗ
	|	Справочник.Склады КАК Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриказНаПроведениеИнвентаризацииТоваров КАК ПриказНаПроведениеИнвентаризацииТоваров
	|		ПО Склады.Ссылка = ПриказНаПроведениеИнвентаризацииТоваров.Склад
	|			И (ПриказНаПроведениеИнвентаризацииТоваров.Проведен)
	|			И (ПриказНаПроведениеИнвентаризацииТоваров.Магазин = &Магазин)
	|			И (ВЫБОР
	|				КОГДА Склады.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА Склады.Организация = ПриказНаПроведениеИнвентаризацииТоваров.Организация
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ Склады.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА Склады.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.ТорговыйЗал)
	|				ТОГДА Склады.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И Склады.Магазин = &Магазин
	|	И ВЫБОР
	|			КОГДА &ТипСклада = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Склады.ТипСклада = &ТипСклада
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склад,
	|	ДатаОкончания УБЫВ
	|ИТОГИ ПО
	|	Склад
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ТекстОшибки = "";
	
	ВыборкаСклад = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСклад.Следующий() Цикл
		
		МассивСтроки = Новый Массив;
		МассивСтроки.Добавить(?(ТипСклада = Перечисления.ТипыСкладов.ТорговыйЗал, НСтр("ru='в торговом зале'"), НСтр("ru='на складе'")));
		МассивСтроки.Добавить(" ");
		МассивСтроки.Добавить(Новый ФорматированнаяСтрока(Строка(ВыборкаСклад.Склад),,,, ПолучитьНавигационнуюСсылку(ВыборкаСклад.Склад)));
		
		ПредставлениеСклада = Новый ФорматированнаяСтрока(МассивСтроки);
		
		Выборка = ВыборкаСклад.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ДокументСсылка.Пустая() Тогда
				
				МассивСтроки = Новый Массив;
				МассивСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Инвентаризация товаров'"),,,, "ОткрытьСписокИнвентаризаций"));
				МассивСтроки.Добавить(" ");
				МассивСтроки.Добавить(ПредставлениеСклада);
				МассивСтроки.Добавить(" ");
				МассивСтроки.Добавить(НСтр("ru='не проводилась.'"));
				
				ТекстОшибки = Новый ФорматированнаяСтрока(МассивСтроки);
				
			ИначеЕсли НачалоДня(Выборка.ДатаОкончания) < НачалоДня(ДобавитьМесяц(ТекущаяДатаСеанса(), -1)) Тогда
				
				МассивСтроки = Новый Массив;
				МассивСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Инвентаризация товаров'"),,,, "ОткрытьСписокИнвентаризаций"));
				МассивСтроки.Добавить(" ");
				МассивСтроки.Добавить(ПредставлениеСклада);
				МассивСтроки.Добавить(" ");
				МассивСтроки.Добавить(НСтр("ru='проводилась больше месяца назад.'"));
				МассивСтроки.Добавить(Символы.ПС);
				МассивСтроки.Добавить(НСтр("ru='Рекомендуется провести повторную инвентаризацию.'"));
				
				ТекстОшибки = Новый ФорматированнаяСтрока(МассивСтроки);
				
			ИначеЕсли Выборка.Статус <> Перечисления.СтатусыПриказовНаПроведениеИнвентаризацийТоваров.Закрыт Тогда
				
				МассивСтроки = Новый Массив;
				МассивСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Инвентаризация товаров'"),,,, "ОткрытьСписокИнвентаризаций"));
				МассивСтроки.Добавить(" ");
				МассивСтроки.Добавить(ПредставлениеСклада);
				МассивСтроки.Добавить(" ");
				МассивСтроки.Добавить(НСтр("ru='не завершена.'"));
				МассивСтроки.Добавить(Символы.ПС);
				МассивСтроки.Добавить(НСтр("ru='Перед корректировкой остатков по регистрам ЕГАИС рекомендуется завершить инвентаризацию.'"));
				
				ТекстОшибки = Новый ФорматированнаяСтрока(МассивСтроки);
				
			КонецЕсли;
			
			Прервать;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецФункции

// Возвращает текст запроса учетных остатков по регистру накопления ТоварыНаСкладах.
//
Функция ТекстЗапросаТоварыНаСкладах(ТорговыйОбъект)
	
	Если НЕ ИспользуетсяНесколькоСкладов(ТорговыйОбъект) Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.Неупакованная)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПродаетсяВРозлив,
		|	ТоварыНаСкладахОстатки.Номенклатура.ОбъемДАЛ КАК ОбъемДАЛ,
		|	ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.ПустаяСсылка)) КАК ТипПродукции,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток * ВЫБОР
		|		КОГДА ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.Неупакованная)
		|			ТОГДА ТоварыНаСкладахОстатки.Номенклатура.ОбъемДАЛ
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ОстатокТорговыйЗал,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК ОстатокТорговыйЗалБазЕд,
		|	0 КАК ОстатокСклад,
		|	0 КАК ОстатокСкладБазЕд
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			&ДатаОстатков,
		|			Склад.Магазин = &Магазин
		|				И Номенклатура.АлкогольнаяПродукция
		|				И НЕ Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив
		|				И ВЫБОР
		|					КОГДА НЕ ЕСТЬNULL(Номенклатура.ВидАлкогольнойПродукцииЕГАИС.Маркируемый, ЛОЖЬ)
		|						ТОГДА &КорректироватьОстаткиНемаркируемойПродукции
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ТоварыНаСкладахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
		|		ПО ТоварыНаСкладахОстатки.Номенклатура = СоответствиеНоменклатурыЕГАИС.Номенклатура
		|			И ТоварыНаСкладахОстатки.Характеристика = СоответствиеНоменклатурыЕГАИС.Характеристика
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.Характеристика КАК Характеристика,
		|	СУММА(ВложенныйЗапрос.ОстатокСклад) КАК ОстатокСклад,
		|	СУММА(ВложенныйЗапрос.ОстатокТорговыйЗал) КАК ОстатокТорговыйЗал,
		|	СУММА(ВложенныйЗапрос.ОстатокСкладБазЕд) КАК ОстатокСкладБазЕд,
		|	СУММА(ВложенныйЗапрос.ОстатокТорговыйЗалБазЕд) КАК ОстатокТорговыйЗалБазЕд
		|ПОМЕСТИТЬ ТоварыНаСкладах
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|		ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
		|		ТоварыНаСкладахОстатки.КоличествоОстаток КАК ОстатокСклад,
		|		ТоварыНаСкладахОстатки.КоличествоОстаток КАК ОстатокСкладБазЕд,
		|		0 КАК ОстатокТорговыйЗал,
		|		0 КАК ОстатокТорговыйЗалБазЕд
		|	ИЗ
		|		РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				&ДатаОстатков,
		|				Склад.Магазин = &Магазин
		|					И Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.СкладскоеПомещение)
		|					И Номенклатура.АлкогольнаяПродукция
		|					И НЕ Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив
		|					И ВЫБОР
		|						КОГДА НЕ ЕСТЬNULL(Номенклатура.ВидАлкогольнойПродукцииЕГАИС.Маркируемый, ЛОЖЬ)
		|							ТОГДА &КорректироватьОстаткиНемаркируемойПродукции
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ) КАК ТоварыНаСкладахОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТоварыНаСкладахОстатки.Номенклатура,
		|		ТоварыНаСкладахОстатки.Характеристика,
		|		0,
		|		0,
		|		ТоварыНаСкладахОстатки.КоличествоОстаток,
		|		ТоварыНаСкладахОстатки.КоличествоОстаток
		|	ИЗ
		|		РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				&ДатаОстатков,
		|				Склад.Магазин = &Магазин
		|					И Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.ТорговыйЗал)
		|					И Номенклатура.АлкогольнаяПродукция
		|					И НЕ Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив
		|					И ВЫБОР
		|						КОГДА НЕ ЕСТЬNULL(Номенклатура.ВидАлкогольнойПродукцииЕГАИС.Маркируемый, ЛОЖЬ)
		|							ТОГДА &КорректироватьОстаткиНемаркируемойПродукции
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ) КАК ТоварыНаСкладахОстатки) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Характеристика
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладах.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.Неупакованная)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПродаетсяВРозлив,
		|	ТоварыНаСкладах.Номенклатура.ОбъемДАЛ КАК ОбъемДАЛ,
		|	ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.ПустаяСсылка)) КАК ТипПродукции,
		|	ТоварыНаСкладах.ОстатокСклад * ВЫБОР
		|		КОГДА ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.Неупакованная)
		|			ТОГДА ТоварыНаСкладах.Номенклатура.ОбъемДАЛ
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ОстатокСклад,
		|	ТоварыНаСкладах.ОстатокТорговыйЗал * ВЫБОР
		|		КОГДА ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.Неупакованная)
		|			ТОГДА ТоварыНаСкладах.Номенклатура.ОбъемДАЛ
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ОстатокТорговыйЗал,
		|	ТоварыНаСкладах.ОстатокСкладБазЕд КАК ОстатокСкладБазЕд,
		|	ТоварыНаСкладах.ОстатокТорговыйЗалБазЕд КАК ОстатокТорговыйЗалБазЕд
		|ИЗ
		|	ТоварыНаСкладах КАК ТоварыНаСкладах
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
		|		ПО ТоварыНаСкладах.Номенклатура = СоответствиеНоменклатурыЕГАИС.Номенклатура
		|			И ТоварыНаСкладах.Характеристика = СоответствиеНоменклатурыЕГАИС.Характеристика
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Возвращает текст запроса учетных остатков по регистру накопления ТоварыОрганизаций.
//
Функция ТекстЗапросаТоварыОрганизаций(ТорговыйОбъект)
	
	Если НЕ ИспользуетсяНесколькоСкладов(ТорговыйОбъект) Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТоварыОрганизацийОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыОрганизацийОстатки.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.Неупакованная)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПродаетсяВРозлив,
		|	ТоварыОрганизацийОстатки.Номенклатура.ОбъемДАЛ КАК ОбъемДАЛ,
		|	ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.ПустаяСсылка)) КАК ТипПродукции,
		|	ТоварыОрганизацийОстатки.КоличествоОстаток * ВЫБОР
		|		КОГДА ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.Неупакованная)
		|			ТОГДА ТоварыОрганизацийОстатки.Номенклатура.ОбъемДАЛ
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ОстатокТорговыйЗал,
		|	ТоварыОрганизацийОстатки.КоличествоОстаток КАК ОстатокТорговыйЗалБазЕд,
		|	0 КАК ОстатокСклад,
		|	0 КАК ОстатокСкладБазЕд
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизаций.Остатки(
		|			&ДатаОстатков,
		|			Склад.Магазин = &Магазин
		|				И Организация = &Организация
		|				И Номенклатура.АлкогольнаяПродукция
		|				И НЕ Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив
		|				И ВЫБОР
		|					КОГДА НЕ ЕСТЬNULL(Номенклатура.ВидАлкогольнойПродукцииЕГАИС.Маркируемый, ЛОЖЬ)
		|						ТОГДА &КорректироватьОстаткиНемаркируемойПродукции
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ТоварыОрганизацийОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
		|		ПО ТоварыОрганизацийОстатки.Номенклатура = СоответствиеНоменклатурыЕГАИС.Номенклатура
		|			И ТоварыОрганизацийОстатки.Характеристика = СоответствиеНоменклатурыЕГАИС.Характеристика
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.Характеристика КАК Характеристика,
		|	СУММА(ВложенныйЗапрос.ОстатокСклад) КАК ОстатокСклад,
		|	СУММА(ВложенныйЗапрос.ОстатокТорговыйЗал) КАК ОстатокТорговыйЗал,
		|	СУММА(ВложенныйЗапрос.ОстатокСкладБазЕд) КАК ОстатокСкладБазЕд,
		|	СУММА(ВложенныйЗапрос.ОстатокТорговыйЗалБазЕд) КАК ОстатокТорговыйЗалБазЕд
		|ПОМЕСТИТЬ ТоварыОрганизаций
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТоварыОрганизацийОстатки.Номенклатура КАК Номенклатура,
		|		ТоварыОрганизацийОстатки.Характеристика КАК Характеристика,
		|		ТоварыОрганизацийОстатки.КоличествоОстаток КАК ОстатокСклад,
		|		ТоварыОрганизацийОстатки.КоличествоОстаток КАК ОстатокСкладБазЕд,
		|		0 КАК ОстатокТорговыйЗал,
		|		0 КАК ОстатокТорговыйЗалБазЕд
		|	ИЗ
		|		РегистрНакопления.ТоварыОрганизаций.Остатки(
		|				&ДатаОстатков,
		|				Склад.Магазин = &Магазин
		|					И Организация = &Организация
		|					И Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.СкладскоеПомещение)
		|					И Номенклатура.АлкогольнаяПродукция
		|					И НЕ Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив
		|					И ВЫБОР
		|						КОГДА НЕ ЕСТЬNULL(Номенклатура.ВидАлкогольнойПродукцииЕГАИС.Маркируемый, ЛОЖЬ)
		|							ТОГДА &КорректироватьОстаткиНемаркируемойПродукции
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ) КАК ТоварыОрганизацийОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТоварыОрганизацийОстатки.Номенклатура,
		|		ТоварыОрганизацийОстатки.Характеристика,
		|		0,
		|		0,
		|		ТоварыОрганизацийОстатки.КоличествоОстаток,
		|		ТоварыОрганизацийОстатки.КоличествоОстаток
		|	ИЗ
		|		РегистрНакопления.ТоварыОрганизаций.Остатки(
		|				&ДатаОстатков,
		|				Склад.Магазин = &Магазин
		|					И Организация = &Организация
		|					И Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.ТорговыйЗал)
		|					И Номенклатура.АлкогольнаяПродукция
		|					И НЕ Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив
		|					И ВЫБОР
		|						КОГДА НЕ ЕСТЬNULL(Номенклатура.ВидАлкогольнойПродукцииЕГАИС.Маркируемый, ЛОЖЬ)
		|							ТОГДА &КорректироватьОстаткиНемаркируемойПродукции
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ) КАК ТоварыОрганизацийОстатки) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Характеристика
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыОрганизаций.Номенклатура КАК Номенклатура,
		|	ТоварыОрганизаций.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.Неупакованная)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПродаетсяВРозлив,
		|	ТоварыОрганизаций.Номенклатура.ОбъемДАЛ КАК ОбъемДАЛ,
		|	ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.ПустаяСсылка)) КАК ТипПродукции,
		|	ТоварыОрганизаций.ОстатокСклад * ВЫБОР
		|		КОГДА ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.Неупакованная)
		|			ТОГДА ТоварыОрганизаций.Номенклатура.ОбъемДАЛ
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ОстатокСклад,
		|	ТоварыОрганизаций.ОстатокТорговыйЗал * ВЫБОР
		|		КОГДА ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.Неупакованная)
		|			ТОГДА ТоварыОрганизаций.Номенклатура.ОбъемДАЛ
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ОстатокТорговыйЗал,
		|	ТоварыОрганизаций.ОстатокСкладБазЕд КАК ОстатокСкладБазЕд,
		|	ТоварыОрганизаций.ОстатокТорговыйЗалБазЕд КАК ОстатокТорговыйЗалБазЕд
		|ИЗ
		|	ТоварыОрганизаций КАК ТоварыОрганизаций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
		|		ПО ТоварыОрганизаций.Номенклатура = СоответствиеНоменклатурыЕГАИС.Номенклатура
		|			И ТоварыОрганизаций.Характеристика = СоответствиеНоменклатурыЕГАИС.Характеристика
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти
